[
  {
    "id": 1,
    "recipeName": "Uttapam",
    "type": "dosa",
    "img": "https://t3.ftcdn.net/jpg/01/15/66/52/360_F_115665272_xRBFr4hHgVUFfdjMAGQpbAAPgTsHJpr6.jpg",
    "procedure":"Heat a non-stick or cast-iron griddle (tawa) on medium heat. Take a ladleful of dosa batter and pour it onto the center of the hot griddle. Use the back of the ladle to spread the batter in a circular motion to form a thick pancake-like shape. Sprinkle chopped onions, tomatoes, green bell pepper (if using), green chilies, and fresh coriander leaves evenly over the uttapam. Drizzle a little oil or ghee around the edges of the uttapam and on the toppings. Allow the uttapam to cook on medium heat until the bottom turns golden brown and crisp. You can lift a corner to check if it's cooked. Carefully flip the uttapam using a spatula and cook the other side until it's cooked through and lightly browned. Once both sides are cooked to your liking, transfer the uttapam to a plate. Repeat the process with the remaining batter and toppings to make more uttapams. Serve hot uttapams with coconut chutney, tomato chutney, or sambar."
  },

  {
    "id": 2,
    "recipeName": "Fish Curry",
    "type": "fish",
    "img": "https://www.thedeliciouscrescent.com/wp-content/uploads/2023/07/Fish-Curry-4.jpg",
    "procedure": "Start by cleaning the fish fillets thoroughly under cold water. Pat them dry with a paper towel and cut them into desired sizes. Season them lightly with salt and turmeric powder, then set aside. Heat oil in a pan over medium heat. Add mustard seeds and cumin seeds. Let them crackle for a few seconds. Add chopped onions to the pan and sauté until they turn golden brown. Add minced garlic, grated ginger, and slit green chilies. Sauté for a couple of minutes until the raw aroma disappears. Now, add chopped tomatoes to the pan and cook until they become soft and mushy. Reduce the heat to low and add turmeric powder, coriander powder, and red chili powder. Stir well and cook the spices for a minute or two. Pour in the coconut milk and bring the mixture to a gentle simmer. Carefully place the seasoned fish fillets into the curry, ensuring they are submerged in the liquid. Cover the pan and let the fish cook for about 8-10 minutes or until it is cooked through. Be careful not to overcook the fish as it can become tough. Once the fish is cooked, adjust the seasoning with salt according to your taste. Garnish the fish curry with fresh cilantro leaves and serve hot with steamed rice or your choice of bread."
  },
  {
    "id": 3,
    "recipeName": "Veg Briyani",
    "type": "veg",
    "img": "https://madhurasrecipe.com/wp-content/uploads/2023/03/Veg-Biryani-Featured.jpg"
  },
  {
    "id": 4,
    "recipeName": "Egg sandwich",
    "type": "egg",
    "img": "https://staticcookist.akamaized.net/wp-content/uploads/sites/22/2021/12/egg1-1200x675.jpg"
  }
]
